package com.zairui.project1.tools;

import java.util.*;

public class NamesTool {
    private static String[] xing = new String[]{
        "赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜",
        "戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐",
        "费","廉","岑","薛","雷","贺","倪","汤","滕","殷","罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄",
        "和","穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒","屈","项","祝","董","梁",
        "杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","锺","徐","丘","骆","高","夏","蔡","田","樊","胡","凌","霍",
        "虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应","宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚",
        "程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","於","惠","甄","麹","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓",
        "牧","隗","山","谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","甯","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景","詹","束","龙",
        "叶","幸","司","韶","郜","黎","蓟","薄","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠","蒙","池","乔","阴","鬱","胥","能","苍","双",
        "闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","郤","璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","郏","浦","尚","农",
        "温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习","宦","艾","鱼","容","向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘",
        "匡","国","文","寇","广","禄","阙","东","欧","殳","沃","利","蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空"
    };

    private static String[] ming = new String[]{
        "兴尧","健豪","维夏","泽晋","望博","彬元","世辉","俊维","杰凯","弘豪",
        "伯懿","春海","晨林","弘畅","彬毅","宇楠","泰元","杰运","韵楠","际云",
        "伯毅","雨鸿","君昭","秀云","弘棋","棋松","知彰","曲鸣","鼎鸿","博福",
        "峻熙","文海","锦颀","宇哲","圣傲","泰若","文云","博君","浩德","俊畅",
        "嘉懿","天雨","琼玖","志宇","如翼","杰瀚","文鼎","文康","玄彤","俊文",
        "煜城","德承","宛央","博临","金波","远图","文西","晋泰","文熙","戏蝶",
        "懿轩","智永","芳苓","昌蝶","鼎雷","文进","桦恒","君畅","圣轩","棋哲",
        "瑞霖","金戈","悠然","风华","博南","恒城","楠鼎","泽胜","晋江","博依",
        "明","青","里","泰","晓","遥","伟","彬","野",
        "天","波","龙","达","寒","棋","瑞","鼎","天",
        "凯","风","棋","悟","圣","磊","瑞","昌","雨",
        "健","庭","尚","灿","瀚","昌","图","浩","博",
        "耀","云","君","华","瀚","凯","钦","志","南",
        "潇","松","明","贤","弘","天","恒","俊","庆",
        "涵","元","奇","恒","智","温","宇","轩","欧",
        "彬","树","浪","善","贵","舟","茂","弘","东"
    };

    public static String createName(){
        Random random = new Random();
        int x = random.nextInt(1000) % xing.length;
        int m = random.nextInt(1000) % ming.length;
        return xing[x]+ming[m];
    }

    //身份证区号
    private static String[] idZone = new String[]{
        //北京市
        "110101","110102","110103","110104","110105","110106","110107","110108","110109","110110",
                "110111","110112","110113","110114","110115","110116","110117",
        //天津市
        "120101","120102","120103","120104","120105","120106","120107","120108","120109","120110",
                "120111","120112","120113","120114","120115",
        //河北省
        "130101","130102","130103","130104","130105","130106","130107","130108"
    };

    public static String getDateBetweenMaxAndMin(int min,int max) {
        //计算两个时间点相隔多少天
        String year = min + ((new Random()).nextInt(1000) % (max - min)) + "";
        String month = (((new Random()).nextInt(1000) % 12) + 1 + "");
        String day = "";
        if("2".equals(month)){
            day = ((new Random()).nextInt(1000) % 29) + 1 +"";
        }else if("4".equals(month) || "6".equals(month) || "9".equals(month) || "11".equals(month)){
            day = ((new Random()).nextInt(1000) % 30) + 1 +"";
        }else{
            day = ((new Random()).nextInt(1000) % 31) + 1 +"";
        }

        if(Integer.parseInt(month) < 10){ month = "0"+ month;};
        if(Integer.parseInt(day) < 10){ day = "0"+ day;};
        return year + month + day;
    }

    public static List<String> idCardNumber(int num,boolean different){
        List<String> idCardNumberList = new ArrayList<>();
        String id = "";
        while(num-- != 0){
            if(different){
                while(id.length() == 0 || idCardNumberList.contains(id)){
                    id = idZone[(new Random()).nextInt(1000) % idZone.length] + getDateBetweenMaxAndMin(1980,2010) + ((new Random()).nextInt(7000) + 1000);
                }
                idCardNumberList.add(id);
            }else{
                idCardNumberList.add(idZone[(new Random()).nextInt(1000) % idZone.length] + getDateBetweenMaxAndMin(1980,2010) + ((new Random()).nextInt(7000) + 1000));
            }
        }
        return idCardNumberList;
    }
}
